/*
   Напишете програма, която изчислява общото количество подправка,
което може да бъде извлечено от източник. Източникът има a
начален добив, който показва колко подправки могат да бъдат добити 
през първия ден. След като е бил добит за един ден, добивът пада с 10,
което означава, че на втория ден ще произведе 10 по-малко подправки,
отколкото на първия, на третия ден 10 по-малко отколкото на втория и 
т.н. (вижте примерите). Един източник се счита за печеливш само ако 
неговият добив е най-малко 100 – когато се очакват по-малко от 
100 подправки на ден, изоставете източника.
Миньорският екип консумира 26 подправки всеки ден в края на смяната си
и още 26, след като мината приключи е изтощен. Имайте предвид, 
че работниците не могат да консумират повече подправки, 
отколкото има в склада.
Когато операцията приключи, отпечатайте на конзолата на два 
отделни реда колко дни е работила мината и общото количество извлечена
подправка.
*/


function spiceMustFlow(startingYield) {
    let day = 0;
    let extractedSpice = 0;

    while (startingYield >= 100) {
        
        extractedSpice += startingYield - 26;
        startingYield -= 10;
        day++;
    }
    extractedSpice -= 26; // and an additional 26 after the mine has been exhausted
    console.log(day);
    console.log(`${Math.max(extractedSpice, 0)}`);
}

spiceMustFlow(111);  // 2   134
spiceMustFlow(450); // 36   8938